IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM31_CONTROLSS_G3_EPWM31.xml
	<register id="CONTROLSS_G3_EPWM31_CAPGATETRIPSEL" acronym="CONTROLSS_G3_EPWM31_CAPGATETRIPSEL" offset="0x1AE" width="16" description="Event Capture Gate Trip input select">
		<bitfield id="TRIPINPUT15" width="1" begin="14" end="14" resetval="0x0" description="TRIP Input 15   0: Trip Input 15 not selected as combinational ORed input  1: Trip Input 15 selected as combinational ORed input to CAPGATE mux" range="14" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT14" width="1" begin="13" end="13" resetval="0x0" description="TRIP Input 14   0: Trip Input 14 not selected as combinational ORed input  1: Trip Input 14 selected as combinational ORed input to CAPGATE mux" range="13" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT13" width="1" begin="12" end="12" resetval="0x0" description="TRIP Input 13   0: Trip Input 13 not selected as combinational ORed input  1: Trip Input 13 selected as combinational ORed input to CAPGATE mux" range="12" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT12" width="1" begin="11" end="11" resetval="0x0" description="TRIP Input 12   0: Trip Input 12 not selected as combinational ORed input  1: Trip Input 12 selected as combinational ORed input to CAPGATE mux" range="11" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT11" width="1" begin="10" end="10" resetval="0x0" description="TRIP Input 11   0: Trip Input 11 not selected as combinational ORed input  1: Trip Input 11 selected as combinational ORed input to CAPGATE mux" range="10" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT10" width="1" begin="9" end="9" resetval="0x0" description="TRIP Input 10   0: Trip Input 10 not selected as combinational ORed input  1: Trip Input 10 selected as combinational ORed input to CAPGATE mux" range="9" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT9" width="1" begin="8" end="8" resetval="0x0" description="TRIP Input 9   0: Trip Input 9 not selected as combinational ORed input  1: Trip Input 9 selected as combinational ORed input to CAPGATE mux" range="8" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT8" width="1" begin="7" end="7" resetval="0x0" description="TRIP Input 8   0: Trip Input 8 not selected as combinational ORed input  1: Trip Input 8 selected as combinational ORed input to CAPGATE mux" range="7" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT7" width="1" begin="6" end="6" resetval="0x0" description="TRIP Input 7   0: Trip Input 7 not selected as combinational ORed input  1: Trip Input 7 selected as combinational ORed input to CAPGATE mux" range="6" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT6" width="1" begin="5" end="5" resetval="0x0" description="TRIP Input 6   0: Trip Input 6 not selected as combinational ORed input  1: Trip Input 6 selected as combinational ORed input to CAPGATE mux" range="5" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT5" width="1" begin="4" end="4" resetval="0x0" description="TRIP Input 5   0: Trip Input 5 not selected as combinational ORed input  1: Trip Input 5 selected as combinational ORed input to CAPGATE mux" range="4" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT4" width="1" begin="3" end="3" resetval="0x0" description="TRIP Input 4   0: Trip Input 4 not selected as combinational ORed input  1: Trip Input 4 selected as combinational ORed input to CAPGATE mux" range="3" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT3" width="1" begin="2" end="2" resetval="0x0" description="TRIP Input 3   0: Trip Input 3 not selected as combinational ORed input  1: Trip Input 3 selected as combinational ORed input to CAPGATE mux" range="2" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT2" width="1" begin="1" end="1" resetval="0x0" description="TRIP Input 2   0: Trip Input 2 not selected as combinational ORed input  1: Trip Input 2 selected as combinational ORed input to CAPGATE mux" range="1" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT1" width="1" begin="0" end="0" resetval="0x0" description="TRIP Input 1   0: Trip Input 1 not selected as combinational ORed input  1: Trip Input 1 selected as combinational ORed input to CAPGATE mux" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM31_CAPINTRIPSEL" acronym="CONTROLSS_G3_EPWM31_CAPINTRIPSEL" offset="0x1B0" width="16" description="Event Capture Trip input select">
		<bitfield id="TRIPINPUT15" width="1" begin="14" end="14" resetval="0x0" description="TRIP Input 15   0: Trip Input 15 not selected as combinational ORed input  1: Trip Input 15 selected as combinational ORed input to CAPIN mux" range="14" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT14" width="1" begin="13" end="13" resetval="0x0" description="TRIP Input 14   0: Trip Input 14 not selected as combinational ORed input  1: Trip Input 14 selected as combinational ORed input to CAPIN mux" range="13" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT13" width="1" begin="12" end="12" resetval="0x0" description="TRIP Input 13   0: Trip Input 13 not selected as combinational ORed input  1: Trip Input 13 selected as combinational ORed input to CAPIN mux" range="12" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT12" width="1" begin="11" end="11" resetval="0x0" description="TRIP Input 12   0: Trip Input 12 not selected as combinational ORed input  1: Trip Input 12 selected as combinational ORed input to CAPIN mux" range="11" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT11" width="1" begin="10" end="10" resetval="0x0" description="TRIP Input 11   0: Trip Input 11 not selected as combinational ORed input  1: Trip Input 11 selected as combinational ORed input to CAPIN mux" range="10" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT10" width="1" begin="9" end="9" resetval="0x0" description="TRIP Input 10   0: Trip Input 10 not selected as combinational ORed input  1: Trip Input 10 selected as combinational ORed input to CAPIN mux" range="9" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT9" width="1" begin="8" end="8" resetval="0x0" description="TRIP Input 9   0: Trip Input 9 not selected as combinational ORed input  1: Trip Input 9 selected as combinational ORed input to CAPIN mux" range="8" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT8" width="1" begin="7" end="7" resetval="0x0" description="TRIP Input 8   0: Trip Input 8 not selected as combinational ORed input  1: Trip Input 8 selected as combinational ORed input to CAPIN mux" range="7" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT7" width="1" begin="6" end="6" resetval="0x0" description="TRIP Input 7   0: Trip Input 7 not selected as combinational ORed input  1: Trip Input 7 selected as combinational ORed input to CAPIN mux" range="6" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT6" width="1" begin="5" end="5" resetval="0x0" description="TRIP Input 6   0: Trip Input 6 not selected as combinational ORed input  1: Trip Input 6 selected as combinational ORed input to CAPIN mux" range="5" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT5" width="1" begin="4" end="4" resetval="0x0" description="TRIP Input 5   0: Trip Input 5 not selected as combinational ORed input  1: Trip Input 5 selected as combinational ORed input to CAPIN mux" range="4" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT4" width="1" begin="3" end="3" resetval="0x0" description="TRIP Input 4   0: Trip Input 4 not selected as combinational ORed input  1: Trip Input 4 selected as combinational ORed input to CAPIN mux" range="3" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT3" width="1" begin="2" end="2" resetval="0x0" description="TRIP Input 3   0: Trip Input 3 not selected as combinational ORed input  1: Trip Input 3 selected as combinational ORed input to CAPIN mux" range="2" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT2" width="1" begin="1" end="1" resetval="0x0" description="TRIP Input 2   0: Trip Input 2 not selected as combinational ORed input  1: Trip Input 2 selected as combinational ORed input to CAPIN mux" range="1" rwaccess="R/W"/> 
		<bitfield id="TRIPINPUT1" width="1" begin="0" end="0" resetval="0x0" description="TRIP Input 1   0: Trip Input 1 not selected as combinational ORed input  1: Trip Input 1 selected as combinational ORed input to CAPIN mux" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM31_CAPTRIPSEL" acronym="CONTROLSS_G3_EPWM31_CAPTRIPSEL" offset="0x1B2" width="16" description="Event Capture Signal Select">
		<bitfield id="CAPGATECOMPSEL" width="4" begin="7" end="4" resetval="0x0" description="Digital Compare A Low Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by CAPGATETRIPSEL register ORed together]" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CAPINCOMPSEL" width="4" begin="3" end="0" resetval="0x0" description="Digital Compare A High Input Select Bits   0000: TRIPIN1  0001: TRIPIN2  0010: TRIPIN3  0011: TRIPIN4  ...  1011: TRIPIN12  1100: Reserved  1101: TRIPIN14  1110: TRIPIN15  1111: Trip combination input [all trip inputs selected by CAPINTRIPSEL register ORed together]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM31_SPARE1" acronym="CONTROLSS_G3_EPWM31_SPARE1" offset="0x1EC" width="16" description="Spare1 register">
		<bitfield id="SPARE1_BITS" width="8" begin="7" end="0" resetval="0x0" description="Not used in design currently" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM31_SPARE2" acronym="CONTROLSS_G3_EPWM31_SPARE2" offset="0x1F0" width="16" description="Spare2 register">
		<bitfield id="SPARE2_BITS" width="8" begin="7" end="0" resetval="0x0" description="Not used in design currently" range="7 - 0" rwaccess="R/W"/>
	</register>
